
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user , expiring 15 Aug 2023
Serial number: 401709210928
  Licensed to: Francis Peng
               

Notes:
      1. Unicode is supported; see help unicode_advice.
      2. Maximum number of variables is set to 5,000; see help set_maxvar.

Checking for updates...
(contacting http://www.stata.com)

Update status
    Last check for updates:  04 Feb 2023
    New update available:    none         (as of 04 Feb 2023)
    Current update level:    10 Jan 2023  (what's new)

Possible actions

    Do nothing; all files are up to date.

Click to edit automatic update checking preferences

. help dsregress

. pwd
C:\Users\franc\Documents

. cd C:\Users\franc\Documents\THESIS\scrape_cab
C:\Users\franc\Documents\THESIS\scrape_cab

. ls
  <dir>   2/05/23 15:30  .                 
  <dir>   2/05/23 15:30  ..                
  <dir>   2/05/23 16:30  .git              
   0.1k   1/10/23 18:38  .gitignore        
   0.9k   1/31/23 17:22  1.20.23.txt       
3618.4k   2/05/23 16:30  analysis.ipynb    
   0.3k   1/12/23 17:30  append_basic.py   
  <dir>   1/14/23 15:48  basic_df          
2804.8k   1/13/23 12:36  basic_df_full.csv 
  19.1k   1/19/23 20:40  cleaning.ipynb    
   1.4k   1/15/23 17:34  cleaning.py       
 108.6k   1/14/23 15:50  crash_ss.png      
  <dir>   1/14/23 12:01  details_df        
2978.8k   1/19/23 19:59  df_basic_detail.csv
3139.3k   1/19/23 20:39  full_df.csv       
   0.0k  11/01/22 15:24  geckodriver.log   
  42.8k   2/05/23 11:51  icolors.csv       
   0.6k   2/05/23 13:24  otherecolors.csv  
   1.6k   2/05/23 14:41  othericolors.csv  
1868.5k   1/31/23 17:22  pairplot.png      
  <dir>   1/14/23 12:01  qanda_df          
  17.0M   2/05/23 16:49  regression_df.csv 
   9.0k   1/14/23 11:33  scraper.ipynb     
  19.4k   1/14/23 15:21  scraper.py        
  42.7k   1/10/23 13:35  test_ss.png       
8171.5k   2/05/23 11:27  thread_cleaning.ipynb
  <dir>   1/14/23 12:01  thread_df         
 261.5k   1/19/23 20:37  thread_sentiment.csv

. import delimited using regression_df.csv
(encoding automatically selected: ISO-8859-1)
(1,040 vars, 8,392 obs)

. drop v1

. help xpogress

. hel pxporegress

. help xporegress

. xporegress end_bid reserve num* milage private_seller sentiment_score title_status, controls(year trans_automatic-ico
> lor_yellow)

Cross-fit fold 1 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for num_highlights using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_seller_notes using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin

Cross-fit fold 2 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for num_highlights using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_seller_notes using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin

Cross-fit fold 3 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for num_highlights using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_seller_notes using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin

Cross-fit fold 4 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for num_highlights using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_seller_notes using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin

Cross-fit fold 5 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for num_highlights using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_seller_notes using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin

Cross-fit fold 6 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for num_highlights using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_seller_notes using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin

Cross-fit fold 7 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for num_highlights using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_seller_notes using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin

Cross-fit fold 8 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for num_highlights using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_seller_notes using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin

Cross-fit fold 9 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for num_highlights using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_seller_notes using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin

Cross-fit fold 10 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for num_highlights using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_seller_notes using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin

Cross-fit partialing-out             Number of obs                =      8,392
linear model                         Number of controls           =      1,019
                                     Number of selected controls  =        580
                                     Number of folds in cross-fit =         10
                                     Number of resamples          =          1
                                     Wald chi2(18)                =    1052.06
                                     Prob > chi2                  =     0.0000

-------------------------------------------------------------------------------------
                    |               Robust
            end_bid | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
--------------------+----------------------------------------------------------------
            reserve |   4095.879   446.0621     9.18   0.000     3221.613    4970.145
           num_bids |   43.77423   27.97173     1.56   0.118    -11.04935    98.59781
            num_com |   28.61079   43.01138     0.67   0.506    -55.68997    112.9115
     num_highlights |   490.5624   351.0537     1.40   0.162    -197.4902    1178.615
      num_equipment |   738.9371   82.74101     8.93   0.000     576.7677    901.1065
  num_modifications |   39.55729   35.54092     1.11   0.266    -30.10164    109.2162
    num_known_flaws |  -953.2108   78.03233   -12.22   0.000    -1106.151   -800.2703
num_service_history |  -272.9945    70.8239    -3.85   0.000    -411.8068   -134.1822
    num_other_items |   363.1711   107.9527     3.36   0.001     151.5878    574.7545
  num_owner_history |  -40.01216   2329.308    -0.02   0.986    -4605.372    4525.347
   num_seller_notes |  -107.8896   291.3146    -0.37   0.711    -678.8558    463.0767
         num_videos |  -163.0177   109.4185    -1.49   0.136     -377.474    51.43866
          num_views |    1.11735   .1339129     8.34   0.000     .8548852    1.379814
         num_photos |   18.62471   6.172263     3.02   0.003     6.527292    30.72212
             milage |  -.0773194   .0054209   -14.26   0.000    -.0879442   -.0666946
     private_seller |   -461.537   672.9968    -0.69   0.493    -1780.586    857.5124
    sentiment_score |   1219.824   1874.647     0.65   0.515    -2454.417    4894.064
       title_status |   2617.551   1583.572     1.65   0.098    -486.1926    5721.294
-------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. dsregress end_bid reserve num* milage private_seller sentiment_score title_status, controls(year trans_automatic-icol
> or_yellow)

Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for num_highlights using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_seller_notes using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin

Double-selection linear model         Number of obs               =      8,392
                                      Number of controls          =      1,019
                                      Number of selected controls =        358
                                      Wald chi2(18)               =    1119.67
                                      Prob > chi2                 =     0.0000

-------------------------------------------------------------------------------------
                    |               Robust
            end_bid | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
--------------------+----------------------------------------------------------------
            reserve |   2999.128   405.1119     7.40   0.000     2205.123    3793.133
           num_bids |   5.408607   31.53949     0.17   0.864    -56.40765    67.22487
            num_com |   83.73809   47.35617     1.77   0.077    -9.078294    176.5545
     num_highlights |   253.5146   315.5698     0.80   0.422    -364.9907      872.02
      num_equipment |   650.1404   77.36464     8.40   0.000     498.5085    801.7723
  num_modifications |   13.58416   37.54251     0.36   0.717     -59.9978    87.16612
    num_known_flaws |  -802.0265    70.9237   -11.31   0.000    -941.0344   -663.0186
num_service_history |  -225.8691   62.85475    -3.59   0.000    -349.0622   -102.6761
    num_other_items |   232.8917   105.8332     2.20   0.028     25.46237    440.3211
  num_owner_history |  -1244.135   2183.171    -0.57   0.569    -5523.072    3034.803
   num_seller_notes |  -244.8441   269.8853    -0.91   0.364    -773.8096    284.1214
         num_videos |  -85.85087    99.9997    -0.86   0.391    -281.8467    110.1449
          num_views |   1.214524   .1263506     9.61   0.000     .9668812    1.462166
         num_photos |   16.18223   5.702977     2.84   0.005     5.004602    27.35986
             milage |  -.0898132   .0056846   -15.80   0.000    -.1009549   -.0786715
     private_seller |  -383.5981   595.4382    -0.64   0.519    -1550.636    783.4393
    sentiment_score |   2453.386   1459.337     1.68   0.093     -406.863    5313.634
       title_status |   2079.587   1642.917     1.27   0.206    -1140.471    5299.645
-------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. poregress end_bid reserve num* milage private_seller sentiment_score title_status, controls(year trans_automatic-icol
> or_yellow)

Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for num_highlights using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_seller_notes using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin

Partialing-out linear model          Number of obs                =      8,392
                                     Number of controls           =      1,019
                                     Number of selected controls  =        358
                                     Wald chi2(18)                =    1110.08
                                     Prob > chi2                  =     0.0000

-------------------------------------------------------------------------------------
                    |               Robust
            end_bid | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
--------------------+----------------------------------------------------------------
            reserve |   3924.911   426.5383     9.20   0.000     3088.911    4760.911
           num_bids |   16.70081   28.90141     0.58   0.563    -39.94491    73.34653
            num_com |   88.20054   44.42276     1.99   0.047     1.133534    175.2675
     num_highlights |   443.2206   320.2772     1.38   0.166    -184.5112    1070.953
      num_equipment |   698.4558   78.60963     8.89   0.000     544.3837    852.5278
  num_modifications |   12.48206   35.22196     0.35   0.723    -56.55172    81.51583
    num_known_flaws |  -906.4582   73.37644   -12.35   0.000    -1050.273    -762.643
num_service_history |  -240.8323     64.803    -3.72   0.000    -367.8438   -113.8207
    num_other_items |   274.2382   106.2773     2.58   0.010     65.93858    482.5379
  num_owner_history |  -1015.297   2465.797    -0.41   0.681    -5848.171    3817.577
   num_seller_notes |  -276.7237   291.0461    -0.95   0.342    -847.1636    293.7162
         num_videos |  -65.73539   103.9459    -0.63   0.527    -269.4657    137.9949
          num_views |   1.149832   .1204984     9.54   0.000     .9136597    1.386005
         num_photos |   17.38254    5.95123     2.92   0.003     5.718341    29.04673
             milage |  -.0766449    .005185   -14.78   0.000    -.0868073   -.0664825
     private_seller |     -836.1    642.703    -1.30   0.193    -2095.775    423.5748
    sentiment_score |   2790.886   1609.612     1.73   0.083    -363.8962    5945.669
       title_status |   2238.092   1601.426     1.40   0.162    -900.6459    5376.829
-------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. xporegress end_bid reserve-private_seller num_equipment-num_other_items num_videos sentiment_score title_status senti
> ment_score title_status, controls(year trans_automatic-icolor_yellow)
note: sentiment_score omitted because of collinearity.
note: title_status omitted because of collinearity.

Cross-fit fold 1 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin

Cross-fit fold 2 of 10 ...
Estimating lasso for end_bid using plugin
--Break--
r(1);

. xporegress end_bid reserve-private_seller num_equipment-num_other_items num_videos sentiment_score title_status senti
> ment_score title_status, controls(year make_ac-icolor_yellow)
note: sentiment_score omitted because of collinearity.
note: title_status omitted because of collinearity.

Cross-fit fold 1 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin
--Break--
r(1);

. xporegress end_bid reserve-private_seller num_equipment-num_other_items num_videos sentiment_score title_status senti
> ment_score title_status, controls(year make_am-icolor_white)
note: sentiment_score omitted because of collinearity.
note: title_status omitted because of collinearity.

Cross-fit fold 1 of 10 ...
Estimating lasso for end_bid using plugin
--Break--
r(1);

. dsregress end_bid reserve-private_seller num_equipment-num_other_items num_videos sentiment_score title_status sentim
> ent_score title_status, controls(year make_am-icolor_white)
note: sentiment_score omitted because of collinearity.
note: title_status omitted because of collinearity.

Estimating lasso for end_bid using plugin
--Break--
r(1);

. dsregress end_bid reserve num* milage private_seller sentiment_score title_status, controls(year trans_automatic-icol
> or_yellow)

Estimating lasso for end_bid using plugin
--Break--
r(1);

. dsregress end_bid num_bids num_com reserve-private_seller num_equipment-num_other_items num_videos sentiment_score ti
> tle_status sentiment_score title_status, controls(year make_am-icolor_white)
note: num_bids omitted because of collinearity.
note: num_com omitted because of collinearity.
note: sentiment_score omitted because of collinearity.
note: title_status omitted because of collinearity.

Estimating lasso for end_bid using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
--Break--
r(1);

. dsregress end_bid num_bids num_com reserve-private_seller num_equipment-num_other_items num_videos sentiment_score ti
> tle_status sentiment_score title_status, controls(year make_amgeneral-icolor_white)
note: num_bids omitted because of collinearity.
note: num_com omitted because of collinearity.
note: sentiment_score omitted because of collinearity.
note: title_status omitted because of collinearity.

Estimating lasso for end_bid using plugin
--Break--
r(1);

. dsregress end_bid reserve num_bids num_com milage private_seller num_equipment num_modifications num_known_flaws num_
> service_history num_other_items num_owner_history num_videos sentiment_score title_status num_views num_photos, contr
> ols(year make_amgeneral-model_ix)

Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin

Double-selection linear model         Number of obs               =      8,392
                                      Number of controls          =        968
                                      Number of selected controls =        296
                                      Wald chi2(16)               =    1171.15
                                      Prob > chi2                 =     0.0000

-------------------------------------------------------------------------------------
                    |               Robust
            end_bid | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
--------------------+----------------------------------------------------------------
            reserve |   3136.223   422.4382     7.42   0.000      2308.26    3964.187
           num_bids |  -6.426304   30.02923    -0.21   0.831    -65.28252    52.42991
            num_com |   76.04999   45.97402     1.65   0.098    -14.05744    166.1574
             milage |  -.0935764   .0057338   -16.32   0.000    -.1048145   -.0823383
     private_seller |  -5.846552   608.5843    -0.01   0.992     -1198.65    1186.957
      num_equipment |    705.241   80.83473     8.72   0.000     546.8079    863.6742
  num_modifications |   15.09872   37.57838     0.40   0.688    -58.55355    88.75099
    num_known_flaws |  -920.9439   71.64112   -12.85   0.000    -1061.358   -780.5299
num_service_history |  -313.0978   65.20253    -4.80   0.000    -440.8924   -185.3032
    num_other_items |   330.5829   108.7312     3.04   0.002     117.4737     543.692
  num_owner_history |   -998.934   2173.883    -0.46   0.646    -5259.667    3261.799
         num_videos |  -133.1159   101.0037    -1.32   0.188    -331.0794    64.84766
    sentiment_score |   1867.793   1482.245     1.26   0.208    -1037.355    4772.941
       title_status |   1071.703   1751.549     0.61   0.541     -2361.27    4504.677
          num_views |   1.281637   .1242427    10.32   0.000     1.038126    1.525148
         num_photos |   13.27734   5.745057     2.31   0.021     2.017231    24.53744
-------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. xporegress end_bid reserve num_bids num_com milage private_seller num_equipment num_modifications num_known_flaws num
> _service_history num_other_items num_owner_history num_videos sentiment_score title_status num_views num_photos, cont
> rols(year make_amgeneral-model_ix)

Cross-fit fold 1 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin

Cross-fit fold 2 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin

Cross-fit fold 3 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin

Cross-fit fold 4 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin

Cross-fit fold 5 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin

Cross-fit fold 6 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin

Cross-fit fold 7 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin

Cross-fit fold 8 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin

Cross-fit fold 9 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin

Cross-fit fold 10 of 10 ...
Estimating lasso for end_bid using plugin
Estimating lasso for reserve using plugin
Estimating lasso for num_bids using plugin
Estimating lasso for num_com using plugin
Estimating lasso for milage using plugin
Estimating lasso for private_seller using plugin
Estimating lasso for num_equipment using plugin
Estimating lasso for num_modifications using plugin
Estimating lasso for num_known_flaws using plugin
Estimating lasso for num_service_history using plugin
Estimating lasso for num_other_items using plugin
Estimating lasso for num_owner_history using plugin
Estimating lasso for num_videos using plugin
Estimating lasso for sentiment_score using plugin
Estimating lasso for title_status using plugin
Estimating lasso for num_views using plugin
Estimating lasso for num_photos using plugin

Cross-fit partialing-out             Number of obs                =      8,392
linear model                         Number of controls           =        968
                                     Number of selected controls  =        491
                                     Number of folds in cross-fit =         10
                                     Number of resamples          =          1
                                     Wald chi2(16)                =    1196.65
                                     Prob > chi2                  =     0.0000

-------------------------------------------------------------------------------------
                    |               Robust
            end_bid | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
--------------------+----------------------------------------------------------------
            reserve |   4150.458   456.3622     9.09   0.000     3256.004    5044.911
           num_bids |   28.19259   28.25368     1.00   0.318     -27.1836    83.56879
            num_com |   15.35929   39.18248     0.39   0.695    -61.43697    92.15554
             milage |  -.0842132    .005378   -15.66   0.000    -.0947538   -.0736726
     private_seller |   206.0237   666.3321     0.31   0.757    -1099.963    1512.011
      num_equipment |   693.3069     83.731     8.28   0.000     529.1972    857.4167
  num_modifications |  -14.00859   35.81141    -0.39   0.696    -84.19768    56.18049
    num_known_flaws |  -1140.281   80.05519   -14.24   0.000    -1297.186   -983.3757
num_service_history |  -342.0659   68.76497    -4.97   0.000    -476.8428    -207.289
    num_other_items |   455.4822   111.8948     4.07   0.000     236.1724    674.7921
  num_owner_history |  -736.4012   2552.119    -0.29   0.773    -5738.462     4265.66
         num_videos |  -132.2887   107.3342    -1.23   0.218    -342.6598    78.08242
    sentiment_score |  -155.4908   1832.308    -0.08   0.932    -3746.748    3435.766
       title_status |   1495.103   1646.042     0.91   0.364     -1731.08    4721.286
          num_views |   1.347365   .1576319     8.55   0.000     1.038412    1.656317
         num_photos |   17.41861   6.014431     2.90   0.004     5.630539    29.20668
-------------------------------------------------------------------------------------
Note: Chi-squared test is a Wald test of the coefficients of the variables
      of interest jointly equal to zero. Lassos select controls for model
      estimation. Type lassoinfo to see number of selected variables in each
      lasso.

. 
